In [2]:
import pandas as pd

In [5]:
data_wide = {
    'ID': ['A', 'B'],
    'Year 1': [50, 40],
    'Year 2': [55, 42],
    'Year 3': [60, 45]
}

df_wide = pd.DataFrame(data_wide)
print(df_wide, "\n")

df_long = pd.melt(df_wide, id_vars = ['ID'], var_name = 'Year', value_name = 'Value')
print(df_long)

  ID  Year 1  Year 2  Year 3
0  A      50      55      60
1  B      40      42      45

  ID    Year  Value
0  A  Year 1     50
1  B  Year 1     40
2  A  Year 2     55
3  B  Year 2     42
4  A  Year 3     60
5  B  Year 3     45

In [9]:
df_wide2 = df_long.pivot(index = 'ID', columns = 'Year', values = 'Value')
print(df_wide2, "\n")
df_wide2.columns = [col.replace('Year', 'Year') for col in df_wide2.columns]
print(df_wide2)

Year  Year 1  Year 2  Year 3
ID
A         50      55      60
B         40      42      45

    Year 1  Year 2  Year 3
ID
A       50      55      60
B       40      42      45

Reading and Writing DataFrames to CSV files

In [83]:
csv_file_path = "C2M1-Datasets/popularity.csv"
#df_csv = pd.read_csv(csv_file_path)
df_csv = pd.read_csv(csv_file_path, 
                     sep=',', 
                     header=0, 
                     na_values=['NA','N/A', '--'], 
                     #usecols=["url","timedelta"],
                     usecols=[0,1],  
                     dtype = {'url':str}, 
                     nrows = 10,
                    )
df_csv.head(20)

                                                 url   timedelta
0  http://mashable.com/2013/01/07/amazon-instant-...       731.0
1  http://mashable.com/2013/01/07/ap-samsung-spon...       731.0
2  http://mashable.com/2013/01/07/apple-40-billio...       731.0
3  http://mashable.com/2013/01/07/astronaut-notre...       731.0
4   http://mashable.com/2013/01/07/att-u-verse-apps/       731.0
5   http://mashable.com/2013/01/07/beewi-smart-toys/       731.0
6  http://mashable.com/2013/01/07/bodymedia-armba...       731.0
7   http://mashable.com/2013/01/07/canon-poweshot-n/       731.0
8  http://mashable.com/2013/01/07/car-of-the-futu...       731.0
9  http://mashable.com/2013/01/07/chuck-hagel-web...       731.0

In [15]:
data = {
    'Transaction_ID': [101, 102, 103, 104, 105],
    'Customer_Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Product': ['Laptop', 'Phone', 'Tablet', 'Headphones', 'Monitor'],
    'Amount': [1200, 800, 450, 200, 300],
    'Date': ['2025-06-01', '2025-06-02', '2025-06-03', '2025-06-04', '2025-06-05']
}

df = pd.DataFrame(data)
df.to_csv('transaction_data.csv', index = False, header = True)

In [93]:
df = pd.read_csv("Bank Dataset/bank_marketing_updated_v1.csv", skiprows=2, na_values=['NA','inf'])
#print(df.head())
df.info()
df.fillna(0)
df["age"]= df["age"].astype(int)
df.age.mean()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45211 entries, 0 to 45210
Data columns (total 19 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   customerid  45211 non-null  int64
 1   age         45191 non-null  float64
 2   salary      45211 non-null  int64
 3   balance     45211 non-null  int64
 4   marital     45211 non-null  object
 5   jobedu      45211 non-null  object
 6   targeted    45211 non-null  object
 7   default     45211 non-null  object
 8   housing     45211 non-null  object
 9   loan        45211 non-null  object
 10  contact     45211 non-null  object
 11  day         45211 non-null  int64
 12  month       45161 non-null  object
 13  duration    45211 non-null  object
 14  campaign    45211 non-null  int64
 15  pdays       45211 non-null  int64
 16  previous    45211 non-null  int64
 17  poutcome    45211 non-null  object
 18  response    45181 non-null  object
dtypes: float64(1), int64(7), object(11)
memory usage: 6.6+ MB

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer

Reading and Writing DataFrames to Text Files

In [18]:
with open('employees.txt', 'w') as f:
    f.write("Name\tDepartment\tSalary\n")
    f.write("Alice\tHR\t50000\n")
    f.write("Bob\tEngineering\t65000\n")
    f.write("Carol\tMarketing\t55000\n")

df = pd.read_table("employees.txt")
print(df)

    Name   Department  Salary
0  Alice           HR   50000
1    Bob  Engineering   65000
2  Carol    Marketing   55000

In [22]:
df = pd.read_table('C2M1-Datasets/Text File 2.txt')
df

      Name  Age      City  Unnamed: 3
0    Alice   30  New York         NaN
1      Bob   25    London         NaN
2  Charlie   35     Paris         NaN

In [24]:
with open('C2M1-Datasets/Text File 3.txt', 'r') as f:
    print(f.read())

Name     Age City
Alice    30  New York
Bob      25  London
Charlie  35  Paris

In [26]:
df = pd.read_fwf('C2M1-Datasets/Text File 3.txt')  # for fixed-width files
df

      Name  Age      City
0    Alice   30  New York
1      Bob   25    London
2  Charlie   35     Paris

In [29]:
# Example TXT read
txt_file_path = 'C2M1-Datasets/Text File 1.txt'  # Replace with your TXT file path
with open(txt_file_path, 'r', encoding='utf-8') as f:
    text = f.read()
print(text[:300])  # print first 300 characters

with open(txt_file_path, 'r', encoding='utf-8') as f:
    lines = f.readlines()
print(lines[:5])  # print first 5 lines

Name,Age,City
Alice,30,New York
Bob,25,London
Charlie,35,Paris
['Name,Age,City\n', 'Alice,30,New York\n', 'Bob,25,London\n', 'Charlie,35,Paris']

In [30]:

# Example DataFrame
data = {
    'Transaction_ID': [101, 102, 103, 104, 105],
    'Customer_Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Product': ['Laptop', 'Phone', 'Tablet', 'Headphones', 'Monitor'],
    'Amount': [1200, 800, 450, 200, 300],
    'Date': ['2025-06-01', '2025-06-02', '2025-06-03', '2025-06-04', '2025-06-05']
}

# Create a DataFrame
df = pd.DataFrame(data)
df

# Writing the DataFrame to a CSV file (which is a type of text file)
df.to_csv('output.txt', sep='\t', index=False)  # Tab-separated file

Reading and Writing DataFrames to Excel files

In [34]:
df = pd.read_excel( "C2M1-Datasets/SuperStoreUS-2015.xlsx",
                   sheet_name="Orders",
                   usecols=["Region","Sales","Profit"],
                   skiprows=0,
                   nrows=100,
                   dtype={"Region":str,"Sales":float},
                   na_values=["NA", "missing"]
)
df

     Region      Profit    Sales
0      West     4.56000    13.01
1      West  4390.36650  6362.85
2      East   -53.80960   211.15
3   Central   803.47050  1164.45
4   Central   -24.03000    22.23
..      ...         ...      ...
95    South   280.27458   130.62
96    South  -112.42630  6945.16
97    South    24.92400    30.94
98     East    -2.90950     3.42
99     West   -76.89000   901.81

[100 rows x 3 columns]

In [42]:
data = {
    'Transaction_ID': [101, 102, 103, 104, 105],
    'Customer_Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Product': ['Laptop', 'Phone', 'Tablet', 'Headphones', 'Monitor'],
    'Amount': [1200, 800, 450, 200, 300],
    'Date': ['2025-06-01', '2025-06-02', '2025-06-03', '2025-06-04', '2025-06-05']
}

# Create a DataFrame
df = pd.DataFrame(data)

print(df)
excelpath = "transaction1.xlsx"
df.to_excel( excelpath,
             sheet_name="df_data",
             index=False,
             header=True,
             startrow=0
)

   Transaction_ID Customer_Name     Product  Amount        Date
0             101         Alice      Laptop    1200  2025-06-01
1             102           Bob       Phone     800  2025-06-02
2             103       Charlie      Tablet     450  2025-06-03
3             104         David  Headphones     200  2025-06-04
4             105           Eve     Monitor     300  2025-06-05

Reading and Writing DataFrames to JSON files

In [44]:
df = pd.read_json(
    path_or_buf="C2M1-Datasets/titanic.json",  # Path to the JSON file
    orient=None,                 # Infers the structure format (used when not JSON Lines)
    typ='frame',                 # Return a DataFrame (default is 'frame'; other option is 'series')
    dtype=True,                  # Let pandas infer column data types
    convert_axes=True,           # Convert axes to proper types (e.g., numeric index)
    convert_dates=True,          # Automatically convert date strings to datetime
    keep_default_dates=True,     # Also parse pandas-specific date formats
    precise_float=False,         # Set to True for higher precision in floating point numbers
    date_unit='ms',              # Use when converting numeric dates (ignored here, but good to know)
    encoding='utf-8',            # Encoding used to decode the file
    lines=True                   # Required for JSON Lines format (NDJSON)
)

df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,None,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,None,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,None,Q

In [45]:
data = {
    'Transaction_ID': [101, 102, 103, 104, 105],
    'Customer_Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Product': ['Laptop', 'Phone', 'Tablet', 'Headphones', 'Monitor'],
    'Amount': [1200, 800, 450, 200, 300],
    'Date': ['2025-06-01', '2025-06-02', '2025-06-03', '2025-06-04', '2025-06-05']
}

df = pd.DataFrame(data)
print(df)

df.to_json("transaction_data1.json", orient="records", lines=True )

   Transaction_ID Customer_Name     Product  Amount        Date
0             101         Alice      Laptop    1200  2025-06-01
1             102           Bob       Phone     800  2025-06-02
2             103       Charlie      Tablet     450  2025-06-03
3             104         David  Headphones     200  2025-06-04
4             105           Eve     Monitor     300  2025-06-05

Read and write to SQL file

In [48]:
import sqlite3

with open('C2M1-Datasets/Create database.sql', 'r') as f:
    sql_script = f.read()

conn = sqlite3.connect(':memory:')

conn.executescript(sql_script)

df = pd.read_sql_query("SELECT * FROM users", conn)

print(df)

conn.close()

   id     name  age
0   1    Alice   30
1   2      Bob   25
2   3  Charlie   35

In [49]:
conn = sqlite3.connect(':memory:')
conn.execute("CREATE TABLE sample_table (id INTEGER PRIMARY KEY, name TEXT, value REAL)")
conn.execute("INSERT INTO sample_table (name, value) VALUES ('Alice', 23.5), ('Bob', 45.2), ('Charlie', 31.8)")

sql_query = 'SELECT * FROM sample_table'
df = pd.read_sql_query(sql=sql_query, con=conn, index_col='id')

print(df)

conn.close()

       name  value
id
1     Alice   23.5
2       Bob   45.2
3   Charlie   31.8

In [54]:
data = {
    'Transaction_ID': [101, 102, 103, 104, 105],
    'Customer_Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Product': ['Laptop', 'Phone', 'Tablet', 'Headphones', 'Monitor'],
    'Amount': [1200, 800, 450, 200, 300],
    'Date': ['2025-06-01', '2025-06-02', '2025-06-03', '2025-06-04', '2025-06-05']
}

# Create a DataFrame
df = pd.DataFrame(data)

with open('transaction_data.sql', 'w') as file:
    # Write the CREATE TABLE statement
    file.write("CREATE TABLE IF NOT EXISTS transactions (\n")
    file.write("    Transaction_ID INTEGER PRIMARY KEY,\n")
    file.write("    Customer_Name TEXT,\n")
    file.write("    Product TEXT,\n")
    file.write("    Amount INTEGER,\n")
    file.write("    Date TEXT\n")
    file.write(");\n\n")

    for i, row in df.iterrows():
        file.write(f"INSERT INTO transactions (Transaction_ID, Customer_Name, Product, Amount, Date) VALUES ({row['Transaction_ID']}, '{row['Customer_Name']}', '{row['Product']}', {row['Amount']}, '{row['Date']}');\n")

Reading HTML tables

In [61]:
pip install lxml

SyntaxError: invalid syntax (3667458138.py, line 1)

In [68]:
pip install requests

Defaulting to user installation because normal site-packages is not writeable
Collecting requests
  Downloading requests-2.32.5-py3-none-any.whl.metadata (4.9 kB)
Collecting charset_normalizer<4,>=2 (from requests)
  Downloading charset_normalizer-3.4.4-cp313-cp313-win_amd64.whl.metadata (38 kB)
Collecting idna<4,>=2.5 (from requests)
  Downloading idna-3.11-py3-none-any.whl.metadata (8.4 kB)
Collecting urllib3<3,>=1.21.1 (from requests)
  Downloading urllib3-2.5.0-py3-none-any.whl.metadata (6.5 kB)
Collecting certifi>=2017.4.17 (from requests)
  Downloading certifi-2025.10.5-py3-none-any.whl.metadata (2.5 kB)
Downloading requests-2.32.5-py3-none-any.whl (64 kB)
Downloading charset_normalizer-3.4.4-cp313-cp313-win_amd64.whl (107 kB)
Downloading idna-3.11-py3-none-any.whl (71 kB)
Downloading urllib3-2.5.0-py3-none-any.whl (129 kB)
Downloading certifi-2025.10.5-py3-none-any.whl (163 kB)
Installing collected packages: urllib3, idna, charset_normalizer, certifi, requests

   ---------------------------------------- 0/5 [urllib3]
   ---------------- ----------------------- 2/5 [charset_normalizer]
   ---------------------------------------- 5/5 [requests]

Successfully installed certifi-2025.10.5 charset_normalizer-3.4.4 idna-3.11 requests-2.32.5 urllib3-2.5.0
Note: you may need to restart the kernel to use updated packages.

In [71]:
!{sys.executable} -m pip install requests

'C:\Users\Dhivya' is not recognized as an internal or external command,
operable program or batch file.

In [72]:
import pandas as pd
import requests

In [80]:
url = "https://en.wikipedia.org/wiki/List_of_Netflix_original_films_(2024)"
headers = {
    "User-Agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/91.0.4472.124 Safari/537.36"
}

response = requests.get(url, headers=headers)

tables = pd.read_html(response.text)

print(f"Found {len(tables)} tables on the page.")

df = tables[0]
print(df.head(1))
df.columns

df = df.rename(columns={
    'Title': 'Film_Title',
    'Release date': 'Release_Date',
    'Genre(s)': 'Genres',
    'Director(s)': 'Directors',
    # Add more renames based on actual header names
})

df['Release_Date'] = pd.to_datetime(df['Release_Date'], errors='coerce', dayfirst=True)

# 🎉 Final: `df` now holds the Netflix films list in a tidy, pandas-ready format
print(df.info())

Found 5 tables on the page.
                 Title     Release date           Genre     Runtime Language
0  Society of the Snow  January 4, 2024  Disaster drama  2 h 25 min  Spanish
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 137 entries, 0 to 136
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Film_Title    137 non-null    object
 1   Release_Date  137 non-null    datetime64[ns]
 2   Genre         137 non-null    object
 3   Runtime       137 non-null    object
 4   Language      137 non-null    object
dtypes: datetime64[ns](1), object(4)
memory usage: 5.5+ KB
None

C:\Users\Dhivya Karthikeyan\AppData\Local\Temp\ipykernel_21260\291233833.py:8: FutureWarning: Passing literal html to 'read_html' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  tables = pd.read_html(response.text)